---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem
source: html/5577c879-577e-412b-13e1-b57ec78a1666.htm
---
# DuctFittingAndAccessoryPressureDropItem Members

Releases all resources used by the DuctFittingAndAccessoryPressureDropItem